import 'dart:ffi';

final stationNames = [
  '서울대학교',
  '경영대',
  '수의대입구 보건대학원앞',
  '국제대학원',
  '관악사삼거리',
  '공동기기원',
  '유전공학연구소 반도체공동연구소',
  '에너지자원연구소',
  "신소재",
  '건설환경종합연구소앞',
  '제 2공학관',
];

final Map<String, Map<String, double>> stationLocations = {
  '서울대학교': {"lat": 37.466886, "long": 126.947713},
  '경영대': {"lat": 37.465847, "long": 126.951114},
  '수의대입구 보건대학원앞': {"lat": 37.465936, "long": 126.954662},
  '국제대학원': {"lat": 37.463594, "long": 126.954806},
  '관악사삼거리': {"lat": 37.460452, "long": 126.956738},
  '공동기기원': {"lat": 37.455065, "long": 126.954511},
  '유전공학연구소 반도체공동연구소': {"lat": 37.453736, "long": 126.953518},
  '에너지자원연구소': {"lat": 37.45354, "long": 126.952107},
  '신소재': {"lat": 37.453609, "long": 126.950175},
  '건설환경종합연구소앞': {"lat": 37.447144, "long": 37.447144},
  '제 2공학관': {"lat": 37.448072, "long": 126.951995}
};
